;----------------------------------------------------
; # # DO NOT REMOVE ANYTHING FROM THIS SECTION # # # 
;----------------------------------------------------

[Variables]
@IncludeConfig=#CURRENTPATH#Config\FolderConfig.inc

;----------------------------------------------------
; # # BEGIN EDITING BELOW # # # # # # # # # # # # # #
;----------------------------------------------------

NumberOfItems=11

NumberOfDividers=0

;----------------------------------------------------

ItemText1=Auto
ItemAction1=[!SetVariable SourceLanguageCheckmark 1][!WriteKeyValue Variables SourceLanguageCheckmark 1 "#MyVariablesLoc#"][!SetVariable SourceLanguage "auto"][!WriteKeyValue Variables SourceLanguage "auto" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText2=English
ItemAction2=[!SetVariable SourceLanguageCheckmark 2][!WriteKeyValue Variables SourceLanguageCheckmark 2 "#MyVariablesLoc#"][!SetVariable SourceLanguage "en"][!WriteKeyValue Variables SourceLanguage "en" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText3=French
ItemAction3=[!SetVariable SourceLanguageCheckmark 3][!WriteKeyValue Variables SourceLanguageCheckmark 3 "#MyVariablesLoc#"][!SetVariable SourceLanguage "fr"][!WriteKeyValue Variables SourceLanguage "fr" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText4=German
ItemAction4=[!SetVariable SourceLanguageCheckmark 4][!WriteKeyValue Variables SourceLanguageCheckmark 4 "#MyVariablesLoc#"][!SetVariable SourceLanguage "de"][!WriteKeyValue Variables SourceLanguage "de" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText5=Spanish
ItemAction5=[!SetVariable SourceLanguageCheckmark 5][!WriteKeyValue Variables SourceLanguageCheckmark 5 "#MyVariablesLoc#"][!SetVariable SourceLanguage "es"][!WriteKeyValue Variables SourceLanguage "es" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText6=Italian
ItemAction6=[!SetVariable SourceLanguageCheckmark 6][!WriteKeyValue Variables SourceLanguageCheckmark 6 "#MyVariablesLoc#"][!SetVariable SourceLanguage "it"][!WriteKeyValue Variables SourceLanguage "it" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText7=Polish
ItemAction7=[!SetVariable SourceLanguageCheckmark 7][!WriteKeyValue Variables SourceLanguageCheckmark 7 "#MyVariablesLoc#"][!SetVariable SourceLanguage "pl"][!WriteKeyValue Variables SourceLanguage "pl" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText8=Russian
ItemAction8=[!SetVariable SourceLanguageCheckmark 8][!WriteKeyValue Variables SourceLanguageCheckmark 8 "#MyVariablesLoc#"][!SetVariable SourceLanguage "ru"][!WriteKeyValue Variables SourceLanguage "ru" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText9=Portuguese
ItemAction9=[!SetVariable SourceLanguageCheckmark 9][!WriteKeyValue Variables SourceLanguageCheckmark 9 "#MyVariablesLoc#"][!SetVariable SourceLanguage "pt"][!WriteKeyValue Variables SourceLanguage "pt" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText10=Japanese
ItemAction10=[!SetVariable SourceLanguageCheckmark 10][!WriteKeyValue Variables SourceLanguageCheckmark 10 "#MyVariablesLoc#"][!SetVariable SourceLanguage "ja"][!WriteKeyValue Variables SourceLanguage "ja" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

ItemText11=Chinese
ItemAction11=[!SetVariable SourceLanguageCheckmark 11][!WriteKeyValue Variables SourceLanguageCheckmark 11 "#MyVariablesLoc#"][!SetVariable SourceLanguage "zh-CN"][!WriteKeyValue Variables SourceLanguage "zh-CN" "#MyVariablesLoc#"][!UpdateMeter *][!Redraw]

;----------------------------------------------------
; Icons
;----------------------------------------------------

[1Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>1?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[2Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>2?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[3Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>3?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[4Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>4?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[5Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>5?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[6Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>6?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[7Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>7?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[8Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>8?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[9Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>9?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[10Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>10?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)

[11Icon]
ImageAlpha=(#SourceLanguageCheckmark#<>11?(#DropdownItemOpacity#/3):#DropdownItemOpacity#)
